function hat_y=omp(s,T,N)
%  OMP的函数
%  s-测量；T-观测矩阵；N-向量大小

Size=size(T);                                     %  观测矩阵大小
M=Size(1);                                        %  测量
hat_y=zeros(1,N);                                 %  待重构的谱域(变换域)向量                     
Aug_t=[];                                         %  增量矩阵(初始值为空矩阵)
r_n=s;                                            %  残差值

for times=1:M                                    %  迭代次数（不会超过测量值）

    for col=1:N                                 %  恢复矩阵的所有列向量
        product(col)=abs(T(:,col)'*r_n);          %  恢复矩阵的列向量和残差的投影系数(内积值) 
    end
    [val,pos]=max(product);                       %  最大投影系数对应的位置
    Aug_t=[Aug_t,T(:,pos)];                       %  矩阵扩充
    T(:,pos)=zeros(M,1);                          %  选中的列置零（实质上应该去掉，为了简单我把它置零）
    aug_y=(Aug_t'*Aug_t)^(-1)*Aug_t'*s;           %  最小二乘,使残差最小
    r_n=s-Aug_t*aug_y;                            %  残差
    pos_array(times)=pos;                         %  纪录最大投影系数的位置

    if (abs(aug_y(end))^2/norm(aug_y)<0.0005)       %  自适应截断误差（***需要调整经验值）
        break;
    end
end
hat_y(pos_array)=aug_y;                           %  重构的向量

% function hat_y=omp(s,T,N)
% %  OMP锟侥猴拷锟斤拷
% %  s-锟斤拷锟斤拷锟斤拷T-锟桔诧拷锟斤拷锟絅-锟斤拷锟斤拷锟斤拷小
% 
% Size=size(T);                                     %  锟桔诧拷锟斤拷锟斤拷小
% M=Size(1);                                        %  锟斤拷锟斤拷
% hat_y=zeros(1,N);                                 %  锟斤拷锟截癸拷锟斤拷锟斤拷锟斤拷(锟戒换锟斤拷)锟斤拷锟斤拷                     
% Aug_t=[];                                         %  锟斤拷锟斤拷锟斤拷锟斤拷(锟斤拷始值为锟秸撅拷锟斤拷)
% r_n=s;                                            %  锟叫诧拷值
% 
% for times=1:M;                                    %  锟斤拷锟斤拷锟斤拷岢拷锟斤拷锟斤拷值锟斤拷
% 
%     for col=1:N;                                  %  锟街革拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟?
%         product(col)=abs(T(:,col)'*r_n);          %  锟街革拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷筒胁锟斤拷投影系锟斤拷(锟节伙拷值) 
%     end
%     [val,pos]=max(product);                       %  锟斤拷锟酵队跋碉拷锟斤拷应锟斤拷位锟斤拷
%     Aug_t=[Aug_t,T(:,pos)];                       %  锟斤拷锟斤拷锟斤拷锟斤拷
%     T(:,pos)=zeros(M,1);                          %  选锟叫碉拷锟斤拷锟斤拷锟姐（实锟斤拷锟斤拷应锟斤拷去锟斤拷锟斤拷为锟剿硷拷锟揭帮拷锟斤拷锟斤拷锟姐）
%     aug_y=(Aug_t'*Aug_t)^(-1)*Aug_t'*s;           %  锟斤拷小锟斤拷锟斤拷,使锟叫诧拷锟斤拷小
%     r_n=s-Aug_t*aug_y;                            %  锟叫诧拷
%     pos_array(times)=pos;                         %  锟斤拷录锟斤拷锟酵队跋碉拷锟斤拷位锟斤拷
% 
%     if (abs(aug_y(end))^2/norm(aug_y)<0.0003)       %  锟斤拷锟斤拷应锟截讹拷锟斤拷睿?***锟斤拷要锟斤拷锟斤拷锟斤拷值锟斤拷
%         break;
%     end
% end
% 
% hat_y(pos_array)=aug_y;                           %  锟截癸拷锟斤拷锟斤拷锟斤拷
% end
% %  锟斤拷锟斤拷锟斤拷锟竭ｏ拷沙锟斤拷锟斤拷锟斤拷鄞锟窖э拷锟斤拷锟斤拷锟接癸拷锟斤拷学系锟斤拷wsha@eee.hku.hk
% %  锟轿匡拷锟斤拷锟阶ｏ拷小锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷MATLAB R2007实锟街ｏ拷锟斤拷锟斤拷学锟斤拷沙锟斤拷锟斤拷锟斤拷20锟斤拷  小锟斤拷锟戒换锟节撅拷锟襟方筹拷锟斤拷锟斤拷械锟接︼拷茫锟缴筹拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷写锟斤拷.
% 
% %  锟斤拷锟斤拷锟斤拷小锟斤拷锟戒换锟斤拷锟斤拷图锟斤拷锟叫*N锟斤拷N=2^P锟斤拷P锟斤拷锟斤拷锟斤拷

